# Data Wrangling

In [107]:
# import libraries
import numpy as np
import pandas as pd
import seaborn as sns

In [108]:
# loading titanic dataset using seaborn library
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [109]:
# simple operation
(titanic['age']+12).head(10)

0    34.0
1    50.0
2    38.0
3    47.0
4    47.0
5     NaN
6    66.0
7    14.0
8    39.0
9    26.0
Name: age, dtype: float64

- ### Dealing with missing values
  - Try gathering data again
  - Remove column or either row if it doesn't affect the data
  - Replace the missing value:
    - how?
      - Average value of entire column and place it into missing point
      - Replace it with frequency or MODE
      - Replace based on other functions
      - ML algorithm can also be used
      - Leave it like that 
    - why?
      - It is better because no data will be missing
      - Less acurate

In [110]:
# to check where are missing values
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [111]:
#before removing the column
titanic.shape

(891, 15)

In [112]:
# using dropna() method drop the column which has most missing values i.e ('deck') 
# inplace if kept true it will update the change in original data set
titanic.dropna(subset=['deck'], axis=0, inplace=True)
# after removing the column
titanic.shape

(203, 15)

In [113]:
# the column is removed
titanic.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [114]:
# this will drop the remaining columns with null values
titanic.dropna().isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [115]:
titanic.shape

(203, 15)

### Replacing missing values

In [116]:
ti1 = sns.load_dataset('titanic')
ti1.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [117]:
# finding mean (average)
mean = ti1['age'].mean()
mean

29.69911764705882

In [118]:
ti1['age'] = ti1['age'].replace(np.nan, mean)

In [119]:
ti1.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [120]:
ti1.dropna(subset=['deck'], axis=0, inplace=True)
ti1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [121]:
ti1.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [122]:
ti1['embarked'] = ti1['embarked'].replace(np.nan, 'S')
ti1['embark_town'] = ti1['embark_town'].replace(np.nan, 'Southampton')

In [123]:
ti1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [124]:
# to check data types of each column
titanic.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [125]:
# how to convert data type
titanic['survived'] = titanic['survived'].astype("float64")
titanic.dtypes

survived        float64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [126]:
# we can also convert age into days instead of years
ti1['age'] = ti1['age']*365
ti1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,13870.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,12775.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,19710.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,1460.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,21170.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [127]:
# assignment
ti1['age'] = ti1['age'].astype("int64")
ti1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,13870,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,12775,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,19710,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,1460,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,21170,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [128]:
# rename the column
ti1.rename(columns={"age": "age in days"}, inplace=True)
ti1.head()

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,13870,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,12775,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,19710,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,1460,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,21170,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [129]:
ti2  = ti1

# Data Normalization
- we use parametric analysis for normalized data while non parametric for not normalized data
- Uniform the Data
- Make sure they have same impact
- Also for computational reasons
- Normalization changes the value 0 to 1

In [130]:
ti3 = ti2[["age in days", "fare"]]
ti3.head()

    age in days     fare
1         13870  71.2833
3         12775  53.1000
6         19710  51.8625
10         1460  16.7000
11        21170  26.5500

# Method of Normalization
- Simple feature scaling
  - x(new) = x(old)/x(max)
- Min-Max method
- Z-Score (standard score) -3 to +3
- Log transformation

In [131]:
# we can normalize 'fare'
ti3['fare'] = ti3['fare']/ti3['fare'].max()
ti3.head()

C:\Users\stech\AppData\Local\Temp\ipykernel_11296\3503550666.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ti3['fare'] = ti3['fare']/ti3['fare'].max()

    age in days      fare
1         13870  0.139136
3         12775  0.103644
6         19710  0.101229
10         1460  0.032596
11        21170  0.051822

In [132]:
# we can normalize 'age'
ti3['age in days'] = ti3['age in days']/ti3['age in days'].max()
ti3.head()

C:\Users\stech\AppData\Local\Temp\ipykernel_11296\1431020257.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ti3['age in days'] = ti3['age in days']/ti3['age in days'].max()

    age in days      fare
1        0.4750  0.139136
3        0.4375  0.103644
6        0.6750  0.101229
10       0.0500  0.032596
11       0.7250  0.051822

In [133]:
# min-max method
ti4 = ti2[["age in days", "fare"]]
ti4['fare'] = (ti4['fare'] - ti4['fare'].min()) / (ti4['fare'].max() - ti4['fare'].min())
ti4.head()

C:\Users\stech\AppData\Local\Temp\ipykernel_11296\723603159.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ti4['fare'] = (ti4['fare'] - ti4['fare'].min()) / (ti4['fare'].max() - ti4['fare'].min())

    age in days      fare
1         13870  0.139136
3         12775  0.103644
6         19710  0.101229
10         1460  0.032596
11        21170  0.051822

In [134]:
ti4['age in days'] = (ti4['age in days'] - ti4['age in days'].min()) / (ti4['age in days'].max() - ti4['age in days'].min())
ti4.head()

C:\Users\stech\AppData\Local\Temp\ipykernel_11296\1259299258.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ti4['age in days'] = (ti4['age in days'] - ti4['age in days'].min()) / (ti4['age in days'].max() - ti4['age in days'].min())

    age in days      fare
1      0.468907  0.139136
3      0.430972  0.103644
6      0.671228  0.101229
10     0.038975  0.032596
11     0.721808  0.051822

In [135]:
ti5 = ti2[["age in days", "fare"]]
ti5.head()

    age in days     fare
1         13870  71.2833
3         12775  53.1000
6         19710  51.8625
10         1460  16.7000
11        21170  26.5500

In [136]:
# Z-score (standard score)
ti5['fare'] = (ti5['fare'] - ti5['fare'].mean()) / ti5['fare'].std()
ti5['age in days'] = (ti5['age in days'] - ti5['age in days'].mean()) / ti5['age in days'].std()
ti5.head()

C:\Users\stech\AppData\Local\Temp\ipykernel_11296\3948993176.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ti5['fare'] = (ti5['fare'] - ti5['fare'].mean()) / ti5['fare'].std()
C:\Users\stech\AppData\Local\Temp\ipykernel_11296\3948993176.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ti5['age in days'] = (ti5['age in days'] - ti5['age in days'].mean()) / ti5['age in days'].std()

    age in days      fare
1      0.185295 -0.067879
3     -0.013967 -0.311883
6      1.248025 -0.328489
10    -2.073007 -0.800339
11     1.513707 -0.668161

In [137]:
ti6 = ti2[["age in days", "fare"]]
ti6.head()

    age in days     fare
1         13870  71.2833
3         12775  53.1000
6         19710  51.8625
10         1460  16.7000
11        21170  26.5500

In [138]:
# log transformation
ti6['fare'] = np.log(ti6['fare'])
ti6['age in days'] = np.log(ti6['age in days'])
ti6.head()

c:\Users\stech\AppData\Local\Programs\Python\Python311\Lib\site-packages\pandas\core\arraylike.py:402: RuntimeWarning: divide by zero encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)
C:\Users\stech\AppData\Local\Temp\ipykernel_11296\2938799850.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ti6['fare'] = np.log(ti6['fare'])
C:\Users\stech\AppData\Local\Temp\ipykernel_11296\2938799850.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ti6['age in days'] = np.log(ti6['age in days'])

    age in days      fare
1      9.537484  4.266662
3      9.455245  3.972177
6      9.888881  3.948596
10     7.286192  2.815409
11     9.960340  3.279030

# Binning
- Grouping of values into smaller number of values(bins)
- Convert numeric into categories (teenagers, kids, Adults) or 1-16, 17-30 etc
- To have better understanding of groups
  - low vs mid vs high price

In [139]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1.0,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0.0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1.0,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1.0,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [140]:
ti1.describe()

,survived,pclass,age in days,sibsp,parch,fare
count,203.000000,203.000000,203.000000,203.000000,203.000000,203.000000
mean,0.669951,1.197044,12851.753695,0.443350,0.438424,76.341708
std,0.471393,0.527080,5495.280120,0.629704,0.731133,74.520547
min,0.000000,1.000000,335.000000,0.000000,0.000000,0.000000
25%,0.000000,1.000000,9125.000000,0.000000,0.000000,29.206250
50%,1.000000,1.000000,12410.000000,0.000000,0.000000,55.441700
75%,1.000000,1.000000,17155.000000,1.000000,1.000000,89.552100
max,1.000000,3.000000,29200.000000,3.000000,4.000000,512.329200

In [141]:
# assignment
bins = np.linspace(min(ti1['age in days']), max(ti1['age in days']), num=4)
age_groups = ['Kids', 'Teenagers', 'Adults']
ti1['age in days'] = pd.cut(ti1['age in days'], bins, labels=age_groups, include_lowest=True)
ti1['age in days']

1      Teenagers
3      Teenagers
6         Adults
10          Kids
11        Adults
         ...
871    Teenagers
872    Teenagers
879       Adults
887         Kids
889         Kids
Name: age in days, Length: 203, dtype: category
Categories (3, object): ['Kids' < 'Teenagers' < 'Adults']

***converting categories into dummies***
- easy to use for computation
- Male Female (0, 1)

In [143]:
# how to use get dummies to change data inside a data frame (assignment)
pd.get_dummies(ti1['sex'])

     female  male
1         1     0
3         1     0
6         0     1
10        1     0
11        1     0
..      ...   ...
871       1     0
872       0     1
879       1     0
887       1     0
889       0     1

[203 rows x 2 columns]